lab-descriptor.org
#+title: Lab Descriptor
#+setupfile: ~/apps/org-html-themes/setup/theme-readtheorg.setup
#+export_file_name: docs/array-components.html

* Introduction

  Lab Descriptor is a json file that contains information about
  generation, and deployment of lab pages and related experiments.

* Lab Descriptor Structure

  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | Field                  | Sub Field      | Type              | Description                                         |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *boradArea*            | /name/         | =String=          | Broad Area (Domain) name                            |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  |                        | /link/         | =URL=             | Link to the page on vlab.co.in that                 |
  |                        |                |                   | lists all labs in the domain.                       |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *baseUrl*              |                | =URL=             | A URL has =host= and =url-path=.  baseUrl           |
  |                        |                |                   | contains the =host= part of the lab.                |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *lab*                  |                | =String=          | Lab name as displayed on lab pages.                 |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *deployLab*            |                | =Boolean=         | Should the lab be deployed?                         |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *phase*                |                | =number=          | Virtual Labs Phase                                  |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *collegeName*          |                | =String=          | Name of authoring college.                          |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *introduction*         |                | =String=          | Contents of the =Introduction.html= page.           |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *experiments*          |                | =List Experiment= | List of Experiments.  Each item in this list        |
  |                        |                |                   | is an =Experiment= object.  =Experiment= object     |
  |                        |                |                   | is described [[Experiment][here]]. This list is used for            |
  |                        |                |                   | populating the =List Of Experiments.html= page      |
  |                        |                |                   | and for deployment of experiments.                  |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *experiment-sections*  | /sect-name/    | =String=          | This is required when list of experiments is a      |
  |                        |                |                   | nested list. (ex: Data Structures Lab). Otherwise   |
  |                        |                |                   | just use *experiments* and ommit                    |
  |                        |                |                   | *experiment-sections*.                              |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  |                        | /experiments/  | =List Experiment= | List of experiments in a section.                   |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *targetAudience*       | /UG/           | =List String=     | List of UG degrees, that the lab is targeted        |
  |                        |                |                   | towards.                                            |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  |                        | /PG/           | =List String=     | List of PG degrees that the lab is targeted         |
  |                        |                |                   | towards.                                            |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *objective* [optional] |                | =String=          | Content for =Objective.html= page. This field is    |
  |                        |                |                   | optional.  If this is omitted then =Objective.html= |
  |                        |                |                   | page is not generated.                              |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  | *courseAlignment*      | /description/  | =String=          | Content for =Course Alignment.html= page.           |
  |------------------------+----------------+-------------------+-----------------------------------------------------|
  |                        | /universities/ | =List String=     | Content for =Course Alignment.html= page.           |
  |------------------------+----------------+-------------------+-----------------------------------------------------|

* Experiment

  |-----------------+-----------+---------------------------------------------|
  | Field           | Type      | Description                                 |
  |-----------------+-----------+---------------------------------------------|
  | *name*          | =String=  | Name of the Experiment as displayed on      |
  |                 |           | the Experiment pages.                       |
  |-----------------+-----------+---------------------------------------------|
  | *short-name*    | =String=  | Unique short name for the experiment.       |
  |                 |           | Used in the url path for the experiment.    |
  |-----------------+-----------+---------------------------------------------|
  | *repo*          | =URL=     | URL of the remote repository for the        |
  |                 |           | experiment sources.                         |
  |-----------------+-----------+---------------------------------------------|
  | *branch*        | =String=  | Branch of the remote repository to be used. |
  |-----------------+-----------+---------------------------------------------|
  | *tag* [TODO]    | =String=  | Tag of the repository to be used.           |
  |-----------------+-----------+---------------------------------------------|
  | *deploy* [TODO] | =Boolean= | Should the experiment be deployed.          |
  |-----------------+-----------+---------------------------------------------|

** Example

   #+BEGIN_SRC js

     {
         "name": "Performance Characteristics of Centrifugal Pump",
         "short-name": "centrifugal-pump",
         "repo": "http://vlabs.ac.in/gitlab/central-hosting/fluid/centrifugal-pump-nitk.git",
         "branch": "master",
         "tag": "v1.0.1"
     }

   #+END_SRC

* Empty Lab descriptor

  Following is a lab descriptor file which has not been filled.  Use
  this as a starting point to create the lab descriptor for your lab.

  #+BEGIN_SRC js :eval no :noweb yes :mkdirp yes :tangle ./lab-descriptor.json
    {
        "broadArea": {
            "name": "",
            "link": ""
        },
	"lab": "",
        "deployLab": ,
	"phase": ,
	"collegeName": "",
        "baseUrl": "",
        "introduction": "",
        "experiments": [],
        "targetAudience": {
            "UG": [],
            "PG": []
        },
        "objective": "",
        "courseAlignment": {
            "description": "",
            "universities": []
        }
    }
  #+END_SRC

* Sample Lab Descriptor

  Following lab descriptor is used for testing.

  #+BEGIN_SRC js :eval no :noweb yes :mkdirp yes :tangle ./sample-lab-descriptor.json

    {
        "broadArea": {
            "name": "Civil Engineering",
            "link": "http://vlab.co.in/broad-area-civil-engineering"
        },
        "lab": "Fluid Machinery",
	"deployLab":true,
        "phase": 3,
        "collegeName": "NITS",
        "baseUrl": "http://localhost",
        "introduction": "Welcome to fluid macninery lab!",
        "experiments": [
            {
                "name": "Performance Characteristics of Centrifugal Pump",
                "short-name": "centrifugal-pump",
                "repo": "http://vlabs.iitb.ac.in/gitlab/vlabs-dev-central-hosting/fluid-machinery-nitk/performance-characteristics-centrifugal-pump-nitk.git",
                "branch": "master",
                "tag": "v1.0.0",
                "deploy": true
            },
            {
                "name": "Performance Characteristics of Hydraulic Ram",
                "short-name": "hydraulic-ram",
                "repo": "http://vlabs.iitb.ac.in/gitlab/vlabs-dev-central-hosting/fluid-machinery-nitk/performance-characteristics-hydraulic-ram-nitk.git",
                "branch": "master",
                "tag": "v1.0.0",
                "deploy": false
            }
        ],
        "targetAudience": {
            "UG": [
                "B. Tech./ B.E in Civil Engineering"
            ],
            "PG": [
                "MS/Ph. D. Beginners in Civil Engineering and related topics"
            ]
        },
        "objective": "Hello World.",
        "courseAlignment": {
            "description": "course are listed here:",
            "universities": [
                "Visvesvaraya Technological University Karnataka",
                "National Institute of Technology Karnataka Karnataka",
                "Anna University Tamil Nadu",
                "SRM University Delhi - NCR Sonepat Haryana",
                "University of Kerala Kerala",
                "APJ Abdul Kalam Technological University Kerala",
                "CUSAT Kerala"
            ]
        }
    }  

  #+END_SRC
